let data1 = [
  {
    title: "ยำอกไก่ฉีก",
    cal: 170,
  },
  {
    title: "อกไก่พริกไทยดำย่าง",
    cal: 120,
  },
  {
    title: "ยำไก่ย่างแตงกวา",
    cal: 240,
  },
  {
    title: "โจ๊กข้าวโอ๊ตใส่อกไก่สับและผัก",
    cal: 160,
  },
  {
    title: "สุกี้นำ้อกไก่",
    cal: 350,
  },
  {
    title: "สลัดปลาย่าง",
    cal: 200,
  },
  {
    title: "แกงส้มผักรวมกับปลา + ข้าวกล้อง",
    cal: 180,
  },
  {
    title: "โจ๊กหมู/ข้าวต้มหมู",
    cal: 160,
  },
  {
    title: "ปลานึ่งมะนาว/ปลาเผา",
    cal: 155,
  },
  {
    title: "ยำเห็ดฟาง",
    cal: 164,
  },
  {
    title: "เห็ดฟางผัดน้ำมันหอย",
    cal: 185,
  },
  {
    title: "ยำเห็ดเข็มทอง",
    cal: 100,
  },
  {
    title: "กะเพราอกไก่+ข้าวไรซ์เบอร์รี",
    cal: 450,
  },
  {
    title: "เกาเหลาหมูชิ้น ไม่ใส่กระเทียมเจียว",
    cal: 150,
  },
  {
    title: "ฟักทองผัดไข่+ข้าวกล้อง",
    cal: 220,
  },
  {
    title: "ยำวุ้นเส้นเน้นผัก",
    cal: 160,
  },
  {
    title: "ข้าวกล้องต้มใส่ผักและปลาแห้ง",
    cal: 250,
  },
  {
    title: "โจ๊กใส่ไข่ขาว เห็ดหอม และแครอท",
    cal: 190,
  },
  {
    title: "ข้าวมันอกไก่+แกงจืด",
    cal: 650,
  },
  {
    title: "ยำเห็ดรวมมิตร",
    cal: 160,
  },
  {
    title: "สปาเกตตีเส้นโฮลวีตอกไก่",
    cal: 550,
  },
  {
    title: "สลัดผัก+ไข่ต้ม 2 ฟอง",
    cal: 260,
  },
  {
    title: "ผัดผักกุ้ง+ข้าวกล้อง",
    cal: 310,
  },
  {
    title: "สเต๊กไก่เทริยากิ+ผักนึ่ง",
    cal: 420,
  },
  {
    title: "ส้มตำ+อกไก่ย่าง",
    cal: 280,
  },
  {
    title: "แกงจืดวุ้นเส้นไข่น้ำ+ข้าวกล้อง",
    cal: 310,
  },
  {
    title: "ข้าวต้มกุ้ง+น้ำส้ม",
    cal: 240,
  },
  {
    title: "เส้นหมี่ข้าวกล้องผัดซีอิ๊วอกไก่",
    cal: 450,
  },
  {
    title: "แซนด์วิชอกไก่ย่างพร้อมผัก",
    cal: 270,
  },
  {
    title: "ก๋วยเตี๋ยวลุยสวนหมูสับ+ผลไม้",
    cal: 400,
  },
  {
    title: "สเต๊กไก่พริกไทยดำ+ผักนึ่ง",
    cal: 370,
  },
  {
    title: "ซุปมันฝรั่งมะเขืออกไก่",
    cal: 130,
  },
  {
    title: "สุกี้น้ำเส้นบุกทะเล",
    cal: 280,
  },
  {
    title: "แซนด์วิชสลัดไข่",
    cal: 180,
  },
  {
    title: "ไข่ตุ๋นอกไก่+ฟักทองนึ่ง",
    cal: 360,
  },
  {
    title: "ข้าวไข่ข้นกุ้งสด",
    cal: 250,
  },
  {
    title: "ต้มยำกุ้งน้ำใส+ข้าวกล้อง",
    cal: 210,
  },
  {
    title: "น้ำพริก+ปลาทูทอด+ไข่ต้ม+ข้าวกล้อง",
    cal: 490,
  },
];
let data2 = [
  {
    title: "ทูน่าสลัด",
    cal: 153,
  },
  {
    title: "ยำไข่ต้ม 88/1ฟอง",
    cal: null,
  },
  {
    title: "ลาบอโวคาโด",
    cal: 196,
  },
  {
    title: "ขนมปังโฮลวีตทาอะโวคาโดบด",
    cal: 220,
  },
  {
    title: "ปลาเก๋าย่างสลัดมะม่วง",
    cal: 372,
  },
  {
    title: "สลัดปลาย่าง",
    cal: 281,
  },
  {
    title: "เบคอนกรอกไข่กวน",
    cal: 371,
  },
  {
    title: "เมี่ยงปลาเผา",
    cal: 200,
  },
  {
    title: "ขนมปังทาโยเกิร์ต โรยอัลมอนด์",
    cal: 300,
  },
  {
    title: "ยำลูกชิ้นปลา+ข้าวกล้อง",
    cal: 210,
  },
  {
    title: "ไข่กระทะ+ขนมปังโฮลวีตปิ้ง 1 แผ่น",
    cal: 500,
  },
  {
    title: "สลัดแซลมอน",
    cal: 300,
  },
  {
    title: "ข้าวหน้าปลาแซลมอนย่างเกลือ",
    cal: 250,
  },
  {
    title: "ข้าวปั้นไส้แซลมอน 1 ชิ้น",
    cal: 200,
  },
  {
    title: "ขนมปังปิ้งทาอะโวคาโด+แซลมอนรมควัน+น้ำส้ม 1แก้ว",
    cal: 380,
  },
];
var app = new Vue({
  el: "#app",
  data: {
    title: "Firm Fun Fit",
    height: null,
    weight: null,
    bmi_value: null,
    bmi_size: null,
    calorie_require: null,
    type_set_food: null,
    muscle_building_food_set: {
      bmi24: [
        {
          breakfast: [
            "เเซนด์วิชอกไก่ย่างพร้อมผัก 270 cal",
            "ผัดบล็อกโคลี่อกไก่ 100 cal",
          ],
          lunch: ["ข้าวไข่ข้นกุ้งสด 250 cal", "ต้มยำไก่ 250 cal"],
          dinner: ["ส้มตำ+อกไก่ย่าง 280 cal", "ยำวุ้นเส้นเน้นผัก 160 cal"],
          calorie_total: 1310,
        },
        {
          breakfast: ["ข้าวต้มกุ้ง+น้ำส้ม 240 cal"],
          lunch: ["ข้าวต้มกุ้ง+น้ำส้ม 240 cal"],
          dinner: [
            "ก๋วยเตี๋ยวลุยสวยหมูสับ+ผลไม้ 400 cal",
            "ยำอกไก่ฉีก 170 cal",
          ],
          calorie_total: 1260,
        },
        {
          breakfast: ["ข้าวผัดพริกปลาทู 280 cal", "ต้มยำไก่ 150 cal"],
          lunch: ["ข้าวมันอกไก่+เเกงจืด 650 cal"],
          dinner: ["ปลาเผา 155 cal"],
          calorie_total: 1235,
        },
        {
          breakfast: ["สลัดผัก+ไข่ต้ม2ฟอง 260 cal", "เเซนด์วิชสลัดไข่ 180 cal"],
          lunch: ["ผัดผักกุ้ง+ข้าวกล้อง 310 cal", "ผัดคะน้าอกไก่ 150 cal"],
          dinner: ["สเต็กไก่เทริยากิ+ผักนึ่ง 420 cal"],
          calorie_total: 1320,
        },
        {
          breakfast: ["ฟักทองผัดไข่+ข้าวกล้อง 220 cal", "สลัดปลาย่าง 200 cal"],
          lunch: [
            "แกงจืดวุ่นเส้นไข่น้ำ+ข้าวกล้อง 310 cal",
            "ซุปมันฝรั่งมะเขืออกไก่ 130 cal",
          ],
          dinner: ["สเต็กไก่พริกไทยดำ+ผักนึ่ง 370 cal"],
          calorie_total: 1230,
        },
        {
          breakfast: [
            "ไข่ตุ๋นอกไก่+ฟักทองนึ่ง 360 kcal",
            "โจ๊กใส่ไข่ขาว เห็ดหอม เเละเเครอท 190 cal",
          ],
          lunch: ["เส้นหมี่ข้าวกล้องผัดซีอิ๊วอกไก่ 450 cal"],
          dinner: ["ยำไก่ย่างเเตงกวา 240 cal"],
          calorie_total: 1240,
        },
        {
          breakfast: ["น้ำพริก+ปลาทูทอด+ไข่ต้ม+ข้าวกล้อง 490 cal"],
          lunch: ["สปาเกตตี่เส้นโฮลวีตอกไก่ 550 cal"],
          dinner: ["สุกกี้น้ำอกไก่ 350 cal"],
          calorie_total: 1390,
        },
      ],
      bmi1824: [
        {
          breakfast: [
            "น้ำพริก+ปลาทูทอด+ไข่ต้ม+ข้าวกล้อง 490 cal",
            "แซนด์วิชอกไก่ย่างพร้อมผัก 270 cal",
          ],
          lunch: ["ผัดผักกุ้ง+ข้าวกล้อง 310 cal"],
          dinner: [
            "ก๋วยเตี๋ยวลุยสวนหมูสับ+ผลไม้ 400 cal",
            "ยำเห็ดรวมมิตร 160 cal",
          ],
          calorie_total: 1630,
        },
        {
          breakfast: [
            "แกงจืดวุ้นเส้นไข่น้ำ+ข้าวกล้อง 310 cal",
            "ผัดคะน้าอกไก่ 150 cal",
          ],
          lunch: ["กระเพราอกไก่+ข้าวไรซ์เบอร์รี่ 450 cal", "ต้มยำไก่ 200 cal"],
          dinner: [
            "สเต็กไก่พริกไทยดำ+ผักนึ่ง 370 cal",
            "สลัดอกไก่ย่าง 172 cal",
          ],
          calorie_total: 1652,
        },
        {
          breakfast: [
            "ข้าวผัดพริกปลาทู 280 cal",
            "เห็ดฟางผัดน้ำมันหอย 185 cal",
          ],
          lunch: [
            "เส้นหมี่ข้าวกล้องผัดซีอิ๊วอกไก่ 450 cal",
            "ต้มยำไก่ 200 cal",
          ],
          dinner: ["สเต็กไก่เทริยากิ+ผักนึ่ง 420 cal", "สลัดปลาย่าง 200"],
          calorie_total: 1665,
        },
        {
          breakfast: ["สลัดผัก+ไข่ต้ม2ฟอง 260 cal", "ข้าวต้มไก่ 230 cal"],
          lunch: [
            "สปาเกตตี่เส้นโฮลวีตอกไก่ 550 cal",
            "ผัดบล็อกโคลี่อกไก่ 100 cal",
          ],
          dinner: [
            "ส้มตำ+อกไก่ย่าง 280 cal",
            "ยำเห็ดฟาง 164 cal",
            "ยำวุ้นเส้นเน้นผัก 160 cal",
          ],
          calorie_total: 1744,
        },
        {
          breakfast: [
            "ฟักทองผัดไข่+ข้าวกล้อง 220 cal",
            "เกาเหลาหมูชิ้น ไม่ใส่กระเทียมเจียว 150 cal",
          ],
          lunch: ["ข้าวมันอกไก่+แกงจืด 650 cal"],
          dinner: ["สุกกี้น้ำอกไก่ 350 cal", "ยำไก่ย่างเเตงกวา 240 cal"],
          calorie_total: 1610,
        },
        {
          breakfast: ["ข้าวต้มกุ้ง+น้ำส้ม 240 cal", "ผัดคะน้าอกไก่ 150 cal"],
          lunch: [
            "ไข่ตุ๋นอกไก่+ฟักทองนึ่ง 360 cal",
            "ข้าวไข่ข้นกุ้งสด 250 cal",
          ],
          dinner: ["ข้าวมันอกไก่+แกงจืด 650 cal"],
          calorie_total: 1650,
        },
        {
          breakfast: [
            "ข้าวกล้องต้มใส่ผักเเละปลาเเห้ง 250 cal",
            "เเซนด์วิชสลัดไข่ 180 cal",
          ],
          lunch: [
            "ต้มยำกุ้งน้ำใส+ข้างกล้อง 210 cal",
            "ข้าวราดคะน้าน้ำมันหอย 220 cal",
            "ยำอกไก่ฉีก 170 cal",
          ],
          dinner: ["สเต็กไก่เทริยากิ+ผักนึ่ง 420 cal", "สลัดปลาย่าง 200 cal"],
          calorie_total: 1650,
        },
      ],
      bmi18: [
        {
          breakfast: [
            "ไข่ตุ๋นอกไก่+ฟักทองนึ่ง 360 cal",
            "ข้าวไข่ข้นกุ้งสด 250 cal",
          ],
          lunch: ["ข้าวมันไก่+แกงจืด 650 cal", "สลัดอกไก่ย่าง 172 cal"],
          dinner: [
            "เส้นหมี่ข้างกล้องผัดซีอิ๊วอกไก่ 450 cal",
            "ซุปมันฝรั่งมะเขืออกไก่ 130 cal",
            "ก๋วยเตี๋ยวลุยสวนหมูสับ+ผลไม้ 400",
          ],
          calorie_total: 2532,
        },
        {
          breakfast: [
            "สเต็กไก่เทริยากิ+ผักนึ่ง 420 cal",
            "สุกี้น้ำเส้นบุกทะเล 280 cal",
          ],
          lunch: [
            "สปาเกตตี้เส้นโฮลวีตอกไก่ 550 cal",
            "ยำเห็ดรวมมิตร 160 cal",
            "ยำเห็ดฟาง 164 cal",
          ],
          dinner: [
            "ข้าวต้มหมู 160 cal",
            "ปลานึ่งมะนาว 155 cal",
            "ข้าวมันไก่+แกงจืด 650 cal",
          ],
          calorie_total: 2539,
        },
        {
          breakfast: [
            "กระเพราอกไก่+ข้าวไรซ์เบอร์รี่ 450 cal",
            "ต้มยำไก่ 200 cal",
            "ไข่ตุ๋นอกไก่+ฟักทองนึ่ง 360 cal",
          ],
          lunch: [
            "สุกกี้น้ำอกไก่ 350 cal",
            "อกไก่พริกไทยดำ 120 cal",
            "ยำเห็ดเข็มทอง 100 cal",
          ],
          dinner: [
            "น้ำพริก+ปลาทู+ไข่ต้ม+ข้างกล้อง 490 cal",
            "สเต็กไก่เทริยากิ+ผักนึ่ง 420 cal",
            "ยำวุ้นเส้นเน้นผัก 160 cal",
          ],
          calorie_total: 2650,
        },
        {
          breakfast: [
            "สลัดผัก+ไข่ต้ม2ฟอง 260 cal",
            "ฟักทองผัดไข่+ข้าวกล้อง 220 cal",
            "ซุปมันฝรั่งมะเขืออกไก่ 130 cal",
          ],
          lunch: [
            "สปาเกตตี่เส้นโฮลวีตอกไก่ 550 cal",
            "แซนด์วิชสลัดไข่ 180 cal",
            "สลัดปลาย่าง 200 cal",
          ],
          dinner: [
            "ก๋วยเตี๋ยวลุยสวนหมูสับ+ผลไม้ 400 cal",
            "ผัดผักกุ้ง+ข้างกล้อง 310 cal",
            "ส้มตำ+อกไก่ย่าง 280 cal",
          ],
          calorie_total: 2530,
        },
        {
          breakfast: [
            "สเต็กไก่พริกไทยดำ+ผักนึ่ง 370 cal",
            "สลัดปลาย่าง 200 cal",
            "แซนด์วิชสลัดไข่ 180 cal",
          ],
          lunch: ["ข้าวราดคะน้าน้ำมันหอย 220 cal", "น้ำโค้ก 100"],
          dinner: [
            "แกงจืดวุ้นเส้นไข่น้ำ+ข้าวกล้อง 310 cal",
            "ต้มยำไก่ 200 cal",
            "ผักบล็อกโคลี่อกไก่ 100 cal",
            "ขนมหัวผักกากผัด 560",
            "ซ่าหริ่ม 275",
          ],
          calorie_total: 2515,
        },
        {
          breakfast: [
            "ข้าวต้มกุ้ง+น้ำส้ม 240 cal",
            "แซนด์วิชอกไก่ย่างพร้อมผัก 270 cal",
          ],
          lunch: [
            "ไข่ตุ๋นอกไก่+ฟักทองนึ่ง 360 cal",
            "ต้มยำกุ้งน้ำใส+ข้าวกล้อง 210 cal",
            "สุกกี้น้ำอกไก่ 350 cal",
          ],
          dinner: [
            "ข้าวมันอกไก่+แกงจืด 650 cal",
            "เส้นหมี่ข้าวกล้องผัดซีอิ๊วอกไก่ 450",
          ],
          calorie_total: 2530,
        },
        {
          breakfast: [
            "โจ๊กข้าวโอ๊ตใส่อกไก่สับเเละผัก 160 cal",
            "เห็ดฟางผัดน้ำมันหอย 185 cal",
            "ผัดคะน้าอกไก่ 150 cal",
            "ยำอกไก่ฉีก 170 cal",
          ],
          lunch: [
            "สุกี้น้ำเส้นบุกทะเล 280 cal",
            "แกงส้มผักรวมกับปลา+ข้าวกล้อง 180 cal",
            "ยำไก่ย่างเเตงกวา 240 cal",
          ],
          dinner: [
            "สเต็กไก่เทริยากิ+ผักนึ่ง 420 cal",
            "สปาเกตตี่เส้นโฮลวีตอกไก่ 550 cal",
            "สลัดผัก+ไข่ต้ม2ฟอง 260",
          ],
          calorie_total: 2595,
        },
      ],
    },
    fat_enhancing_food: {
      bmi24: [
        {
          breakfast: ["ขนมปังโฮลวีตทาอะโวคาโดบด+ทูน่าสลัด 373 cal"],
          lunch: ["เบคอนไส้กรอกไข่กวน+กีวี่ปั่น 621 cal"],
          dinner: ["สลัดปลาย่าง 281cal"],
          calorie_total: 1275,
        },
        {
          breakfast: ["ปลาม้วนผักนึ่ง+ข้าวกล้อง 411 cal"],
          lunch: ["ข้าวผัดพริกปลาทู+ยำไข่ต้ม 2 ฟอง 456 cal"],
          dinner: ["ทูน่าสลัด+แอปเปิ้ล 2 ผล 353 cal"],
          calorie_total: 1220,
        },
        {
          breakfast: ["โจ๊กปลา+นมจืด 1แก้ว 326 cal"],
          lunch: ["ปลาเก๋าย่างสลัดมะม่วง+มะม่วง 1 ผล 492 cal"],
          dinner: ["ขนมปังปิ้งทาอะโวคาโด+แซลมอนรมควัน+น้ำส้ม 1แก้ว 385 cal"],
          calorie_total: 1203,
        },
        {
          breakfast: [
            "ขนมปังทาโยเกิร์ต โรยอัลมอนด์+กล้วยหอม 1 ผล+นมจืด 1 แก้ว 560 cal",
          ],
          lunch: ["ข้าวหน้าปลาแซลมอนย่างเกลือ+เมล็ดเจีย 12 กรัม 360 cal"],
          dinner: ["สลัดปลาย่าง+นำ้ผักรวม 1 แก้ว 381cal"],
          calorie_total: 1301,
        },
        {
          breakfast: ["ไข่กระทะ+ขนมปังโฮลวีตปิ้ง 1 แผ่น 500 cal"],
          lunch: ["ข้าวปั้นไส้แซลมอน 2 ชิ้น 400 cal"],
          dinner: ["สลัดแซลมอน 300 cal"],
          calorie_total: 1200,
        },
        {
          breakfast: ["ยำลูกชิ้นปลา+ข้าวกล้อง+นำ้ส้มเขียวหวาน 1 แก้ว 402 cal"],
          lunch: ["ข้าวกล้องต้มใส่ผักและปลาแห้ง+ขนมทาโร่+ชามะนาว 450 cal"],
          dinner: ["เมี่ยงปลาเผา+ข้าวกล้อง+นำ้มะพร้าว 1 แก้ว 360 cal"],
          calorie_total: 1212,
        },
        {
          breakfast: ["แกงส้มผักรวมกับปลา+ข้าวกล้อง+ชาเขียว 1 แก้ว 519 cal"],
          lunch: ["ข้าวหน้าปลาแซลมอนย่างเกลือ+นำ้มะพร้าว 1 แก้ว 370 cal"],
          dinner: ["ลาบอโวคาโด+ฝรั่ง 1 ผล 216 cal"],
          calorie_total: 1205,
        },
      ],
      bmi1824: [
        {
          breakfast: [
            "ขนมปังโฮลวีตทาอะโวคาโดบด+แกงส้มผักรวมกับปลา+ข้าวกล้อง+กล้วย 1 ลูก 550 ",
          ],
          lunch: ["น้ำพริก+ปลาทูทอด+ไข่ต้ม+ข้าวกล้อง+นำ้สับปะรด 525 cal"],
          dinner: ["ปลาเก๋าย่างสลัดมะม่วง 372+นำ้ส้มคั้น 1 แก้ว 532 cal"],
          calorie_total: 1607,
        },
        {
          breakfast: [
            "ไข่กระทะ+ขนมปังโฮลวีตปิ้ง 1 แผ่น+นำ้ผลไม้รวม 1 กล่อง 600 cal",
          ],
          lunch: ["ข้าวปั้นไส้แซลมอน 3 ชิ้น 600 cal"],
          dinner: ["สลัดแซลมอน+องุ่น 1 พวง 420 cal"],
          calorie_total: 1620,
        },
        {
          breakfast: ["ขนมปังทาโยเกิร์ต โรยอัลมอนด์+โกโก้ 200 ml 664 cal"],
          lunch: ["สลัดแซลมอน+ยำไข่ต้ม 2 ฟอง+กล้วยบวชชี 1 ถ้วย 628 cal"],
          dinner: [
            "ยำลูกชิ้นปลา+วุ้นเส้นต้มยำ+ข้าวกล้อง+ดาร์กช็อกโกแลต 515 cal",
          ],
          calorie_total: 1807,
        },
        {
          breakfast: ["ผัดเผ็ดปลาทอด+ข้าวสวย+บราวนี่ 1 ชิ้น 730 cal"],
          lunch: ["ปลาราดซอสมะนาวมันฝรั่งทอด+ข้าวสวย 660 cal"],
          dinner: [
            "ขนมปังปิ้งทาอะโวคาโด+แซลมอนรมควัน+ผัดเปรี้ยวหวานกุ้ง+น้ำส้ม 1แก้ว 514 cal",
          ],
          calorie_total: 1904,
        },
        {
          breakfast: [
            "ข้าวต้มปลา+เต้าหู้นมสด 1 ถ้วย +กล้วยคลุกมะพร้าว 1 ถ้วย 590 cal",
          ],
          lunch: ["ขนมจีนนำ้ยาปลา+ไอศกรีมช็อกโกแลต 2 ก้อน+นำ้ชามะนาว 770 cal"],
          dinner: ["สลัดปลาทูน่า+ถั่วเขียวต้มนำ้ตาล+ส้ม 1 ผล 360 cal"],
          calorie_total: 1720,
        },
        {
          breakfast: ["เบคอนไส้กรอกไข่กวน+แซนด์วิชทูน่า+ขนมต้มมัด 756 cal"],
          lunch: [
            "ข้าวหน้าปลาแซลมอนย่างเกลือ+นำ้มะเขือเทศ+วุ้นมะพร้าวอ่อน 450",
          ],
          dinner: ["ก๋วยเตี๋ยวราดหน้าปลากระพง+เกี๊ยวปลานำ้ 600 cal "],
          calorie_total: 1806,
        },
        {
          breakfast: [
            "ข้าวผัดต้มยำทะเล+ไข่ตุ๋นทรงเครื่อง+กล้วยหอม 1 ผล  679 cal",
          ],
          lunch: ["ปลาแซลมอนย่าง+สลัดปลาทูน่า+คุกกี้ช็อกโกแลตชิพ 650cal"],
          dinner: ["เส้นหมี่ลูกชิ้นนำ้ใส+แอปเปิล 1 ผล  300 cal "],
          calorie_total: 1629,
        },
      ],
      bmi18: [
        {
          breakfast: [
            "สลัดแซลมอน+ยำไข่ต้ม 2 ฟอง+กล้วยบวชชี 1 ถ้วย+นำ้องุ่น 1 แก้ว 730 cal",
          ],
          lunch: [
            "เบคอนไส้กรอกไข่กวน+แซนด์วิชทูน่า+ขนมต้มมัด+โกโก้ 200 ml 1029 cal",
          ],
          dinner: [" กระเพาะปลา+แซนด์วิชแฮมชีส+ไอศกรีมช็อกโกแลต 745 cal "],
          calorie_total: 2504,
        },
        {
          breakfast: [
            "พิซซ่าไส้กรอกชีส+พายทูน่า+ถั่วลิสงต้ม 3 ช้อนโต๊ะ 775 cal",
          ],
          lunch: ["เส้นใหญ่ผัดซีอิ๊วใส่ไข่+แยมโรล+ช็อกโกแลตร้อน 1050 cal"],
          dinner: ["สปาเกตตี้กะเพรากุ้ง+บราวนี่ 825 cal"],
          calorie_total: 2650,
        },
        {
          breakfast: ["มักกะโรนีผัดกุ้ง+ลูกพลับ 1 ผล+นำ้ส้มคั้น 715 cal"],
          lunch: [
            "ก๋วยเตี๋ยวต้มยำ+นำ้มะพร้าว 1 แก้ว +ไอศกรีมสตรอว์เบอร์รี่ 2 ก้อน+โดนัท 1 ชิ้น 1040cal",
          ],
          dinner: [
            "ขนมปังทาโยเกิร์ต โรยอัลมอนด์+ไอศกรีมกะทิ+โกโก้ 200 ml 756 cal",
          ],
          calorie_total: 2511,
        },
        {
          breakfast: [
            "ไข่กระทะ+ขนมปังโฮลวีตปิ้ง 1 แผ่น+สลัดไข่+สลัดปลาทูน่า 780 cal",
          ],
          lunch: [
            "ปลาเก๋าย่างสลัดมะม่วง+มะม่วง 1 ผล+ข้าวเหนียวสังขยา+ชานมเย็น  1070 cal",
          ],
          dinner: [
            "แกงส้มผักรวมกับปลา+ข้าวกล้อง+ซาลาเปาไส้หมู+ชาเขียว 1 แก้ว 721cal",
          ],
          calorie_total: 2571,
        },
        {
          breakfast: ["ข้าวปั้นไส้แซลมอน 4 ชิ้น+โกโก้ 200ml 1107 cal"],
          lunch: ["ก๋วยเตี๋ยวคั่วไก่+ไข่ยัดไส้+บัวลอยเผือก 1010 cal"],
          dinner: ["เกาเหลาราดหน้า+ข้าวกล้อง 750 cal"],
          calorie_total: 2867,
        },
        {
          breakfast: ["โจ๊กหมูตับ ใส่ไข่ลวก+ปีกไก่อบ 3 ชิ้น 950 cal"],
          lunch: [
            "ผัดซีอิ๊วเส้นใหญ่ไก่ใส่ไข่+แอปเปิล+นำ้กีวี่ปั่น 1 แก้ว 1030 cal",
          ],
          dinner: [" ข้าวปลาแซลม่อนทอดพริกไทย+ครีมข้าวโอ๊ต 2 ชิ้น 802 cal"],
          calorie_total: 2782,
        },
        {
          breakfast: ["สปาเกตตี้กะเพรากุ้ง+บราวนี่+กล้วยหอม 1 ผล 985cal"],
          lunch: ["สเต็มไก่ย่าง+ปลาซาบะย่าง+มันบด+ชาเขียวเย็น 1 แก้ว 1300 cal"],
          dinner: ["ปลากระพงนึ่งมะนาว+เค้กช็อกโกแลต 1 ชิ้น  575"],
          calorie_total: 2860,
        },
      ],
    },
    page: 1,
    data2: [
      {
        title: "ทูน่าสลัด",
        cal: 153,
      },
      {
        title: "ยำไข่ต้ม 88/1ฟอง",
        cal: null,
      },
      {
        title: "ลาบอโวคาโด",
        cal: 196,
      },
      {
        title: "ขนมปังโฮลวีตทาอะโวคาโดบด",
        cal: 220,
      },
      {
        title: "ปลาเก๋าย่างสลัดมะม่วง",
        cal: 372,
      },
      {
        title: "สลัดปลาย่าง",
        cal: 281,
      },
      {
        title: "เบคอนกรอกไข่กวน",
        cal: 371,
      },
      {
        title: "เมี่ยงปลาเผา",
        cal: 200,
      },
      {
        title: "ขนมปังทาโยเกิร์ต โรยอัลมอนด์",
        cal: 300,
      },
      {
        title: "ยำลูกชิ้นปลา+ข้าวกล้อง",
        cal: 210,
      },
      {
        title: "ไข่กระทะ+ขนมปังโฮลวีตปิ้ง 1 แผ่น",
        cal: 500,
      },
      {
        title: "สลัดแซลมอน",
        cal: 300,
      },
      {
        title: "ข้าวหน้าปลาแซลมอนย่างเกลือ",
        cal: 250,
      },
      {
        title: "ข้าวปั้นไส้แซลมอน 1 ชิ้น",
        cal: 200,
      },
      {
        title: "ขนมปังปิ้งทาอะโวคาโด+แซลมอนรมควัน+น้ำส้ม 1แก้ว",
        cal: 380,
      },
    ],
    data1: [
      {
        title: "ยำอกไก่ฉีก",
        cal: 170,
      },
      {
        title: "อกไก่พริกไทยดำย่าง",
        cal: 120,
      },
      {
        title: "ยำไก่ย่างแตงกวา",
        cal: 240,
      },
      {
        title: "โจ๊กข้าวโอ๊ตใส่อกไก่สับและผัก",
        cal: 160,
      },
      {
        title: "สุกี้นำ้อกไก่",
        cal: 350,
      },
      {
        title: "สลัดปลาย่าง",
        cal: 200,
      },
      {
        title: "แกงส้มผักรวมกับปลา + ข้าวกล้อง",
        cal: 180,
      },
      {
        title: "โจ๊กหมู/ข้าวต้มหมู",
        cal: 160,
      },
      {
        title: "ปลานึ่งมะนาว/ปลาเผา",
        cal: 155,
      },
      {
        title: "ยำเห็ดฟาง",
        cal: 164,
      },
      {
        title: "เห็ดฟางผัดน้ำมันหอย",
        cal: 185,
      },
      {
        title: "ยำเห็ดเข็มทอง",
        cal: 100,
      },
      {
        title: "กะเพราอกไก่+ข้าวไรซ์เบอร์รี",
        cal: 450,
      },
      {
        title: "เกาเหลาหมูชิ้น ไม่ใส่กระเทียมเจียว",
        cal: 150,
      },
      {
        title: "ฟักทองผัดไข่+ข้าวกล้อง",
        cal: 220,
      },
      {
        title: "ยำวุ้นเส้นเน้นผัก",
        cal: 160,
      },
      {
        title: "ข้าวกล้องต้มใส่ผักและปลาแห้ง",
        cal: 250,
      },
      {
        title: "โจ๊กใส่ไข่ขาว เห็ดหอม และแครอท",
        cal: 190,
      },
      {
        title: "ข้าวมันอกไก่+แกงจืด",
        cal: 650,
      },
      {
        title: "ยำเห็ดรวมมิตร",
        cal: 160,
      },
      {
        title: "สปาเกตตีเส้นโฮลวีตอกไก่",
        cal: 550,
      },
      {
        title: "สลัดผัก+ไข่ต้ม 2 ฟอง",
        cal: 260,
      },
      {
        title: "ผัดผักกุ้ง+ข้าวกล้อง",
        cal: 310,
      },
      {
        title: "สเต๊กไก่เทริยากิ+ผักนึ่ง",
        cal: 420,
      },
      {
        title: "ส้มตำ+อกไก่ย่าง",
        cal: 280,
      },
      {
        title: "แกงจืดวุ้นเส้นไข่น้ำ+ข้าวกล้อง",
        cal: 310,
      },
      {
        title: "ข้าวต้มกุ้ง+น้ำส้ม",
        cal: 240,
      },
      {
        title: "เส้นหมี่ข้าวกล้องผัดซีอิ๊วอกไก่",
        cal: 450,
      },
      {
        title: "แซนด์วิชอกไก่ย่างพร้อมผัก",
        cal: 270,
      },
      {
        title: "ก๋วยเตี๋ยวลุยสวนหมูสับ+ผลไม้",
        cal: 400,
      },
      {
        title: "สเต๊กไก่พริกไทยดำ+ผักนึ่ง",
        cal: 370,
      },
      {
        title: "ซุปมันฝรั่งมะเขืออกไก่",
        cal: 130,
      },
      {
        title: "สุกี้น้ำเส้นบุกทะเล",
        cal: 280,
      },
      {
        title: "แซนด์วิชสลัดไข่",
        cal: 180,
      },
      {
        title: "ไข่ตุ๋นอกไก่+ฟักทองนึ่ง",
        cal: 360,
      },
      {
        title: "ข้าวไข่ข้นกุ้งสด",
        cal: 250,
      },
      {
        title: "ต้มยำกุ้งน้ำใส+ข้าวกล้อง",
        cal: 210,
      },
      {
        title: "น้ำพริก+ปลาทูทอด+ไข่ต้ม+ข้าวกล้อง",
        cal: 490,
      },
    ],
    randomNumber: 0,

    setFoodSelect: null,
  },
  methods: {
    bmiSubmit(e) {
      e.preventDefault();
      if (
        this.height == null ||
        this.weight == null ||
        this.height == "" ||
        this.weight == ""
      )
        return;
      this.bmi_value = (this.weight / (this.height / 100) ** 2).toFixed(2);
      if (this.bmi_value < 18.5) {
        this.bmi_size = "underweight";
        this.calorie_require = "2500++ cal";
        this.type_set_food = "BMI<18";
      } else if (this.bmi_value > 18.6 && this.bmi_value < 24) {
        this.bmi_size = "Normal";
        this.calorie_require = "1600 - 2000 cal";
        this.type_set_food = "BMI<18-24";
      } else if (this.bmi_value > 24) {
        this.bmi_size = "Severely obese";
        this.calorie_require = "1200 - 1400 cal";
        this.type_set_food = "BMI<24";
      }
      this.page = 2;
    },
    changPage(page, title) {
      this.randomSetFood();
      this.page = page;
      this.title = title;
    },
    randomSetFood() {
      this.randomNumber = Math.floor(Math.random() * 7);
    },
  },
});
